# Configuring and verify single area OSPFv2

OSPF is a Link State type Dynamic Routing Protocol. It uses the Shortest Path First algorithm of Dutch computer scientists Edsger Dijkstra. (aka Dijkstra Algorithm).

![Routing-protocols](../Images/dynamic-routing-protocols.png)

There are three versions of OSPF:
OSPFv1 (1989): Old, not in use anymore
OSPFv2 (1998): Used for IPv4
OSPFv3 (2008): Used for IPv6 (can also be used for IPv4, but usually v2 is used)

Routers store information about the network in **LSAs** (Links state Advertisements), which are organised in a structure called the **LSDB** (Links State Database).

Routers will flood LSAs until all routers in the OSPF area develop the same map of the network (LSDB).

In OSPF, there are three main steps in the process of sharing LSAs and determining the best route to each destination in the network.

1. Become neighbours with the other routers to the same segment.
2. Exchange LSAs with neighbour routers.
3. Calculate the best routes to each destination, and insert them into the routing table.

OSPF uses areas to divide up the network.

- An **Area** is a set of routers an links that share the same LSBD. 
- The **backbone area** (area 0) is an area that all other areas must connect to.
- **Internal routers** are routers with all interfaces in the same area.
- **Border area routers** are routers with interfaces in multiple areas.
- **Backbone routers** are routers connected to the backbone area (area 0).
- An **intra-area route** is a route to a destination inside the same OSPF area.
- An **interarea route** is a route to a destination in a different OSPF area.
- OSPF areas should be contiguous.
- All OSPF areas must have at least on ABR (area border router) connected to the backbone area.
- OSPF interfaces in the same subnet must be in the same area.
- An **autonomous system boundary router** (ASBR) is an OSPF router that connects the OSPF network to an external network.

![ospf-areas](../Images/ospf-areas.png)

## Cost
OSPF's metric is called **cost**. It is automatically calculated based on the bandwidth of the interface, by dividing a **reference bandwidth** value by the interface's bandwidth. The default reference bandwidth is 100 Mbps.
- reference bandwidth / interface's bandwidth = cost
- 100,000,000 (100 Mbps) / 10,000,000 (10 Mbps) = 10
So in OSPF, by default, an Ethernet link has a cost of 10

| Link type | Bandwidth | OSPF cost |
|---|---|---|
| Ethernet | 10 Mbps | 10 |
| FastEthernet | 100 Mbps | 1 |
| GigabitEthernet | 1 Gbps | 1 |
| 10GigabitEthernet | 10Gbps | 1 |

OSPF cost cannot be a fraction; Therefore, from FastEthernet up al link type have the same cost: 1 (by Default)

**Loopback interfaces** have a cost of 1.

### Adjusting the reference bandwidth
However, the reference bandwidth can be adjusted:
```
R1(config-router)#auto-cost reference-bandwidth ?
	<1-4294967> The reference bandwidth in terms of Mbits per second
```
It is recommended to configure a reference bandwidth greater than the fastest links in your network (to allow for future upgrades). The reference bandwidth must be consistent across all routers in the network.

### Total cost 
The OSPF cost to a destination is the total cost of the **outgoing** interfaces.

### Manually configuring the OSPF cost  of an interface
```
R1(config)#interface g0/0
R1(config-if)#ip ospf cost ?
   <1-65535>   Cost
```
This cost will take precedence over the auto calculated cost.

### Manually changing the bandwidth of an interface
You could also manually change the bandwidth of an interface (Not recommended). Doing this will affect the cost of the interface. Note: Changing the interface bandwidth doesn't actually change the speed at which the interface operates. The bandwidth is just a value that is used to calculate OSPF cost, EIGRP metric, etc.
```
R1(config)#interface g0/0
R1(config-if)#bandwidth ?
   <1-10000000>   Bandwidth in kilobits
```

### Manually changing the speed of an interface
To change the speed at which the interface operates, use the `speed` command.
```
R1(config)#interface g0/0
R1(config-if)#speed ?
   <1-10000000>   
```

# 3.4.a Neighbor adjacencies

When OSPF is activated on an interface, the router starts sending OSPF hello messages out of the interface at regular intervals. These are used to introduce the router to potential OSPF neighbours.

The default hello timer is 10 seconds on an Ethernet connection. Hello messages are multicast to 224.0.0.5 (multicast address for all OSPF routers). 

OSPF messages are encapsulated in an IP header, with the value of 89 in the protocol field.

## Neighbor states
- **Down**  The router has no neighbours connected to a particular interface.
- **Init state**  Hello packet received, but own router ID is not in the Hello packet.
- **2-way** The router has received a Hello packet with its own RID in it. (They are now ready to share LSAs to build a common LSDB).
- **Exstart**  Routers define a Master/Slave relationship that will ultimately allow for the LSDB exchange. The router with the higher RID will become the Master.
- **Exchange**  Routers exchange DBDs which contain a list of the LSAs in their LSDB.
- **Loading**  Routers send Link State Request (LSR) messages to request that their neighbours sen them any LSAs they don't have. LSAs are sent in Link State Update (LSU) messages. Routers send LSAck messages to acknowledge that they received the LSAs.
- **Full**  Routers ha a full OSPF adjacency and identical LSDBs.

Once routers have reached the Full neighbour state, they continue to send and listen for Hello packets (every 10 seconds by default) to maintain the neighbor adjacency. Every time a Hello packet is received, the Death timer (40 seconds by default) is reset. If the Dead timer counts down to 0 and no Hello message is received, the neighbor is removed. The routers will continue to share LSAs as the network changes to make sure each router has a complete and accurate map of the network (LSDB).

## OSPF message types

| Type | Name | Purpose |
|---|---|---|
| 1 | Hello | Neighbour discovery and maintenance. |
| 2 | Database Description (DBD) | Summary of the LSDB of the router. Used to check if the LSDB of each router is the same. |
| 3 | Link-State Request (LSR) | Requests specific LSAs from the neighbour. |
| 4 | Link-State Update (LSU) | Sends specific LSAs to the neighbour. |
| 5 | Link-State Acknowledgement (LSAck) | Used to acknowledge that the router received a message. |


# 3.4.b Point-to-point
It is one of the three types of OSPF network. It is enabled by default on PPP (Point-to-point protocol) and HDLC (High-Level Data Link Control) interfaces.

 - Routers dynamically discover neighbours by sending/listening for OSPF Hello messages using multicast address 224.0.0.5.
 - A DR/BDR are not elected. Since these encapsulations are used for point-to-point connections, there's no point in electing a DR and BDR. The two routers will for a full adjacency with each other.
# 3.4.c Broadcast (DR/BDR selection)
One of the three types of OSPF network. It is enabled by default on Ethernet and FDDI (Fiber Distributed Data Interfaces) interfaces.
- Routers dynamically discover neigbours by sending/listening for OSPF Hello messages using multicast address 224.0.0.5.
- A DR (Designated Router) and BDR (Backup Designated Router) must be elected on each subnet.
- Routers which  aren't the DR or BDR become a DROther.
- The DR/BDR election order of priority:
	1. Highest OSPF interface priority
	2. Highest OSPF Router ID
- First Place becomes the DR for the subnet, Second Place becomes the BDR.
- The default OSPF interface priority is 1 on all interfaces.

## Changing the priority of an interface
```
R1(config)#interface g0/1
R1(config-if)#ip ospf priority ?
   <0-255> Priority
```
Notes: 
- The DR/BDR election is "non-preemptive". Once the DR/DBR are selected they will keep their role until OSPF is reset, the interface shuts down, etc.
- When the DR goes down, the BDR becomes the new DR. Then an election is held for the next BDR.
- DROthers will only move to FULL state with the DR and BDR. The neighbour state with other DROthers will be 2-way.
- Routers only exchange LSAs with the DR and BDR. DROthers will not exchange LSAs with each other.
- Messages to the DR/BDR are multicast using address 224.0.0.6

# Non-Broadcast
Another of the three types of OSPF network. Enabled by default on Frame Relay and X.25 interfaces.
- In this type of networks you must manually configure neighbours

# Configuring the OSPF network type manually
```
R1(config-if)#ip ospf network ?
  broadcast           Specify OSPF broadcast multi-access network
  non-broadcast       Specify OSPF NBMA network
  point-to-multipoint Specify OSPF point-to-multipoint network
  point-to-point      Specify OSPF point-to-point network
```

# 3.4.d Router ID
Router ID order of priority:
1. Manual configuration
```
R1(config-router)#router-id ?
	A.B.C.D   OSPF router-id in IP address format
```

2. Highest IP address on a loopback interface
3. Highest IP address on a physical interface


# Configuration 

## Activating OSPF globally
```
R1(config)#router ospf ?
	<1-65535>  Process ID

```

```
R1(config)#router ospf 1
R1(config-router)#network 10.0.1.0 0.0.0.3 area 0
R1(config-router)#network 10.0.1.4 0.0.0.3 area 0
R1(config-router)#network 192.168.1.0 0.0.0.255 area 0
```

The `passive-interface` command tells the router to stop sending OSPF "hello" messages out of the interface.
```
R1(config-router)#passive-interface g0/2
```
You should always use this command on interfaces which don't have any OSPF neighbours

You will run the following command when you want to advertise the default gateway to the neighbour routers
```
R1(config-router)#default-information originate
```
By using this command, R1 will become an **ASBR**

OSPF support ECMP and by default is configure to load balance between up to 4 paths with equal cost. If you desire to increase this number, you can do so by running the following command:
```
R1(config-router)#maximum-paths ?
	<1-32>  Number of paths
```

The Administrative Distance of OSPF is 110, but can change it with the following command:
```
R1(config-router)#distance ?
	<1-255> Administrative distance
```


## Activating OSPF directly on an interface

`R1(config-if)#ip ospf <process-id> area <area-number>`

```
R1(config)#interface g0/0
R1(config-if)#ip ospf 1 area 0
R1(config-if)#interface g0/1
R1(config-if)#ip ospf 1 area 0
R1(config-if)#interface g0/2
R1(config-if)#ip ospf 1 area 0
R1(config-if)#interface loop0
R1(config-if)#ip ospf 1 area 0
```

## Show commands
```
R1#show ip protocols
```

```
R1#show ip ospf interface
```

```
R1#show ip ospf interface brief
```

```
R1#show ip ospf interface g0/0
```

```
R1#show ip ospf neighbor
```

## Reseting OSPF 
```
R1#clear ip OSPF process
```

## Shutting down the OSPF process
```
R1(config-router)#shutdown
```
This will shutdown OSPF in all interfaces but will not remove the configuration.

You can enable OSPF with the `no shutdown` command:
```
R1(config-router)#no shutdown
```

## Setting up OSPF password authentication
```
R1(config-if)#ip ospf authentication-key password123
```
Then enable password authentication on the interface:
```
R1(config-if)#ip ospf authentication
```

# Troubleshooting

## Area number mismatch

## Interfaces in different subnets

## OSPF process is shutdown

## Duplicated router id

## Hello and dead timer mismatch
In order to become neighbours router must have the same Hello and Dead timers. You can change these values as follow:
```
R1(config-if)ip ospf hello-interval ?
   <1-65535>  Seconds
```

```
R1(config-if)ip ospf dead-interval ?
   <1-65535>  Seconds
```


## Password authentication doesn't match

## MTU mismatch
If two routers are having trouble establishing a FULL neighbour relationship check that their MTU (Maximum Transmission Unit) match. The mismatch of MTU value causes issues in OSPF.

## Changing MTU value
```
R1(config-if)ip mtu ?
   <68-1500>  MTU (bites)
```

## Network type doesn't match
